BankXml/RTGS_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns3:getStrukturaRtgsNalogaRequest xmlns:ns2="http://nalogZaPlacanje.com" xmlns:ns3="http://strukturaRtgsNaloga.com" xmlns:ns4="http://mt102.BankXml.bankXml.example.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>a7W80cN5/TicNvZ0OFsxqS+3gkT2MxWEnxbyyhT8Mxyt5aSJC1hYd8xFJP4dLameolobbI6qeua/&#13;
wuHZ790HgRuVCFpnyo48TRVQY0M+DywhWO0x++KgfffyvU26JYY1Hi8YhmmDoFI0A6UDGp5q60s7&#13;
Ud5M0HAa4M0j9CS3AizY9E8q/CSvQfP8qrPQ52aaVfPhGZng9we0HO6xTkyAMImw1umPyeBhMhY/&#13;
ibzaX8f+PFMxRa5ul0YzcuhoGBzQonmPPj0Cr5JFE2VwhITUCAM8q3NpyFO7icDW47rNiXL0o6iF&#13;
+jJ4NyOij7TCEn02urwwIZnojBxpYpk9j+NJzg==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>AuM1QLV9XoNZ0j7soNJUqDYjyoCKXKk1r0Yn8L6cWaMu+rrSVDT+yLqxqSNY22kBcxL/MV8Kzz29&#13;
BWsO3utwGUjFwAC/4EQMOBtlen3cLVLB9IBb9nvc59H2vzkW4VR4OgQClINBMdHE/Xz8Z8EIiD6G&#13;
mQhrmLFq+yKlvOQzj7TAVbOKZsvVh0P2XxxCGS3n31adU0BUCCbPRyGuFhVXVBJGjAyc435EZ6NK&#13;
9NjypknCMLaVh/eGc9ZcuVMcHaWvgeSUS6NZKLVnSONlVXj6lhpRHgmCe8XgKockmBwkPN9dkNza&#13;
D1eJmS5ofxHH3mg5TjENxNfn0voE9knqdt4KDMTGC8X6BsN9fq0ALMYkutJ4avc6k2yEaudgCH4k&#13;
3EgCPw62CBDmtJawstTPsH25IkX7Y65HOotlEt3ZIFEAP+vQF+C9YdTDLevh+W1pTd8TPfQzE5km&#13;
HZFP08Y4UQtyCy9Ph0iFGJlIjYHtkVaqxMIKnUK1HMihDSNqNGliYvoy7D5qsgoWGTKOe3XjcWo7&#13;
CduuKXOVIvvaBpsgz+4DwFyDLDz7xpBNu/M7wtwyFFUptwbVNd6sLA6mRG9ETNe+DQvfOmUcREvE&#13;
FdyXm3JPbXFhpJuOH1ETFCXyqwoWrC6l3oAotlsEbmzDAbNd28CfKUh3FfsMEjrDxlxRpR+6Z0ur&#13;
340DAvDwgx7SBoNrVjFJYzlV9qjqIN1UhCd8CZCFRb1TcfFxoyxavbgsDRtEnzwUCap7tyvxdPVF&#13;
ToacsM2gj34oRxwrwPu30vO4l19BQZ8aRcB2/CoCpyquUyQHRr2FFpYTy+RIba+sfRTjvpj9UnxJ&#13;
eudyoOmu2cpg9iYwTfabKgKH5OQuV337esPI50dIiOGWLVkLrK2WrCh0tiOgvUEUX63nP4HkfBGz&#13;
cg3WcHP44mvE1Jnh+8aNRStbsmSfvNiCELsSY7hY7jzECu+wJafIPrU/IK0L/9Fukb8dZ5j/wbaB&#13;
cuDQGVvfm5auxmOkwHPKvm0NHoYu4hpG8QDMk7W/c/mVePWdQBBr06Q6Ke0wVcJmDwulb4eW3pAg&#13;
ousuWtha9zQbtDwwMOy3l1CaiqyscEg0HVT+r/jUZtYuqDXbfMrts0/y5ch4pimsRSLrxNP2wAis&#13;
GBYjYuPOi69Ocu71eEFxy9HZbBQKx6SIPTLBPDseOUCFw98S8kGVmi4ZyyU67byqJRlIqwLANXj7&#13;
VBCm+AREU6kx3MGkNEGjgtSG4msw9k5s/ZzrcYgAsn6SB9T0hY2Yk3fFMaR7jPExCyRam81cUR5G&#13;
RJuxmd9AmKi6YqjPE6swSIpv1H+QEfpXMzWXCCKhZdlyRhDWEPH06i5BRRwnXwc=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns3:getStrukturaRtgsNalogaRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>vc7xxUHpiZB6PrBKVQaDyrDV0OM=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
fgkMiXpXH69C/MPU4o3wY7/vLyHYUStQZjhaFVYT9+eojgzjnnSa29QlZsb9Pjxv8gGyb/2FrbZL&#13;
KRHNQ16dwN7IKwF/xyOn8WKA0SIAg4EvBDVGPmCU81yTyd+Km6ZRoWvrWEseBLzv5/ORbH5f8Vw4&#13;
ThQYW12JtsG9lY+eE+rhb8B+Je5fAErVcXbWhCubePhfmhIO5IBn4UJrv5IdEoiKOT8i6mxspfdK&#13;
u1YmJy3lxH6ezfXHU2WCNY/pdt/d8f8fGKqKOutMFLAQmVeA+MGbAzmHSwKXy3TsWYl0qR/olupO&#13;
hladydi8WGifK/SG5R67MJqoEOtwZ2WHdzoj/w==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
iYFqE4e3bUjAttedcKZSAisg5+YICC8Yf0MmjWxsj5XjlN5kZN6T1RC6zXYH7U2nokaxjGxEeKvq&#13;
gvCJfwiBo+t2lGFyaOU3dietqZWr0scIpm0rVoazZPgCzo3PPK1VBWpyOA7/1UZpPJYxIoQq0ZrR&#13;
NGJPIKLff/UQtyjgf1AQZN7+6Ey5MKfG0NNQtvoO8AgL0CGe81+ziZ7GjbIR11OodRAkFxSz7xeb&#13;
DWOWK5L1jDwPPkyoFpyybsD45Vld/1z0M6kDFzyCm/ha37vqGBBGSKudUVztnMY/jwo9ja3Yd93Q&#13;
3Pe2lZfRAj5qykiOd8WEq4KDJ7/zWU1f0nsu5Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDoDCCAoigAwIBAgIEWUhQxDANBgkqhkiG9w0BAQsFADCBlDEWMBQGA1UEAwwNTmFyb2RuYSBi&#13;
YW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2RuYSBiYW5rYTEMMAoG&#13;
A1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEaMBgGCgmSJomT8ixk&#13;
AQEMCjE0OTc5MTE0MzgwHhcNMTcwNjE5MDAwMDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQD&#13;
DAdCYW5rYSBBMRAwDgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3Ji&#13;
MRowGAYJKoZIhvcNAQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIw&#13;
ggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCJgWoTh7dtSMC2151wplICKyDn5ggILxh/&#13;
QyaNbGyPleOU3mRk3pPVELrNdgftTaeiRrGMbER4q+qC8Il/CIGj63aUYXJo5Td2J62plavSxwim&#13;
bStWhrNk+ALOjc88rVUFanI4Dv/VRmk8ljEihCrRmtE0Yk8got9/9RC3KOB/UBBk3v7oTLkwp8bQ&#13;
01C2+g7wCAvQIZ7zX7OJnsaNshHXU6h1ECQXFLPvF5sNY5YrkvWMPA8+TKgWnLJuwPjlWV3/XPQz&#13;
qQMXPIKb+Frfu+oYEEZIq51RXO2cxj+PCj2Nrdh33dDc97aVl9ECPmrKSI53xYSrgoMnv/NZTV/S&#13;
ey7lAgMBAAGjEzARMA8GA1UdEwEB/wQFMAMBAf8wDQYJKoZIhvcNAQELBQADggEBAG97A295MjBs&#13;
W9KAIx7/VlBabr8edSQbwNqaLPJLT5LeXqrCTaBeBstdUnbxRCduSIoV96h3+ogy22lBm5viOXER&#13;
psHpIRtjoSogXu79aPwGuXfh9ZwcJ0snkOpAC1eITJK2j1gOzT/dj8SY5RP7ptosw0o6HwgzyljK&#13;
O1eNN5AunHsAjCkJMn1eyJJW8bZkjp3HajxoHM5Y7dGc3GYi018+StfkjZC51kj4ZrjRsklhIrrC&#13;
cbKkMsD/PPaZUN96KbMev6exKS3gXxBkyi/4TKpbNblT60MheU7fWgOodF9bswi0x31dftQibjms&#13;
lxmeTI40cje1sxblOwNPGNOc0OA=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>